&Вместо("НачатьВыполнениеКоманды")
Процедура А1_НачатьВыполнениеКоманды(Форма, Команда, Источник)
	ИмяКоманды = Команда.Имя;
	АдресНастроек = Форма.ПараметрыПодключаемыхКоманд.АдресТаблицыКоманд;
	ОписаниеКоманды = ПодключаемыеКомандыКлиентПовтИсп.ОписаниеКоманды(ИмяКоманды, АдресНастроек);
	
	ПараметрыВыполнения = ПараметрыВыполненияКоманды();
	ПараметрыВыполнения.ОписаниеКоманды = Новый Структура(ОписаниеКоманды);
	ПараметрыВыполнения.Форма           = Форма;
	ПараметрыВыполнения.Источник        = Источник;
	ПараметрыВыполнения.ЭтоФормаОбъекта = ТипЗнч(Источник) = Тип("ДанныеФормыСтруктура");
	// Служебные параметры.
	ПараметрыВыполнения.ТребуетсяЗапись         = ПараметрыВыполнения.ЭтоФормаОбъекта И ОписаниеКоманды.РежимЗаписи <> "НеЗаписывать";
	ПараметрыВыполнения.ТребуетсяПроведение     = (ОписаниеКоманды.РежимЗаписи = "Проводить");
	ПараметрыВыполнения.ТребуетсяРаботаСФайлами = ОписаниеКоманды.ТребуетсяРаботаСФайлами;
	ПараметрыВыполнения.ВызовСервераЧерезОбработкуОповещения = Истина;
	
	ПараметрыВыполнения.МассивСсылок = ВыбранныеОбъекты(Источник, ОписаниеКоманды);
	
	Отказ = Ложь;
	ВыполнитьМеханизмыОпределенияПараметровВыполнения(ПараметрыВыполнения, Команда, Отказ);
	
	Если НЕ Отказ Тогда
		ПродолжитьВыполнениеКоманды(ПараметрыВыполнения);
	КонецЕсли;
КонецПроцедуры

&Вместо("ВыполнитьКоманду")
Процедура А1_ВыполнитьКоманду(Форма, Команда, Источник)
	ИмяКоманды = Команда.Имя;
	АдресНастроек = Форма.ПараметрыПодключаемыхКоманд.АдресТаблицыКоманд;
	ОписаниеКоманды = ПодключаемыеКомандыКлиентПовтИсп.ОписаниеКоманды(ИмяКоманды, АдресНастроек);
	
	ПараметрыВыполнения = ПараметрыВыполненияКоманды();
	ПараметрыВыполнения.ОписаниеКоманды = Новый Структура(ОписаниеКоманды);
	ПараметрыВыполнения.Форма           = Форма;
	ПараметрыВыполнения.Источник        = Источник;
	ПараметрыВыполнения.ЭтоФормаОбъекта = ТипЗнч(Источник) = Тип("ДанныеФормыСтруктура");
	// Служебные параметры.
	ПараметрыВыполнения.ТребуетсяЗапись  = ПараметрыВыполнения.ЭтоФормаОбъекта И ОписаниеКоманды.РежимЗаписи <> "НеЗаписывать";
	ПараметрыВыполнения.ТребуетсяПроведение = (ОписаниеКоманды.РежимЗаписи = "Проводить");
	ПараметрыВыполнения.ТребуетсяРаботаСФайлами = ОписаниеКоманды.ТребуетсяРаботаСФайлами;
	
	ПараметрыВыполнения.МассивСсылок = ВыбранныеОбъекты(Источник, ОписаниеКоманды);
	
	Отказ = Ложь;
	ВыполнитьМеханизмыОпределенияПараметровВыполнения(ПараметрыВыполнения, Команда, Отказ);
	
	Если НЕ Отказ Тогда
		ПродолжитьВыполнениеКоманды(ПараметрыВыполнения);
	КонецЕсли;
КонецПроцедуры

Функция ВыполнитьМеханизмыОпределенияПараметровВыполнения(ПараметрыВыполнения, Команда, Отказ)
	ИмяОбработчика = "А1БСП_ПриОпределенииПараметровВыполненияПодключаемойКоманды";
	
	А1Э_Механизмы.ВыполнитьМеханизмыОбработчикаОбъектов(ИмяОбработчика, ПараметрыВыполнения.МассивСсылок, ПараметрыВыполнения, Команда, Отказ);
КонецФункции
